In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/uber

In [20]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/uber
1 rows affected.

[('rides',)]

In [21]:
%%sql
CREATE TABLE Restaurants (
    id INT,
    name VARCHAR(100),
    location VARCHAR(100)
);

INSERT INTO Restaurants (id, name, location) VALUES
(1, 'ABC Bistro', 'New York'),
(2, 'The Foodie', 'Los Angeles'),
(3, 'Tasty Treat', 'Chicago');

 * mysql+mysqlconnector://root:***@localhost/uber
0 rows affected.
3 rows affected.

[]

In [45]:
%%sql

CREATE TABLE Orders (
    order_id INT,
    restaurant_id INT,
    order_date DATE
);

INSERT INTO Orders (order_id, restaurant_id, order_date) VALUES
(1, 1, '2023-01-01'),
(2, 1, '2023-01-02'),
(3, 2, '2023-01-05'),
(4, 4, '2023-01-07'),
(2, 2, '2023-01-05');

 * mysql+mysqlconnector://root:***@localhost/uber
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [46]:
%%sql
select * from Restaurants

 * mysql+mysqlconnector://root:***@localhost/uber
3 rows affected.

[(1, 'ABC Bistro', 'New York'),
 (2, 'The Foodie', 'Los Angeles'),
 (3, 'Tasty Treat', 'Chicago')]

In [47]:
%%sql
select * from Orders

 * mysql+mysqlconnector://root:***@localhost/uber
5 rows affected.

[(1, 1, datetime.date(2023, 1, 1)),
 (2, 1, datetime.date(2023, 1, 2)),
 (3, 2, datetime.date(2023, 1, 5)),
 (4, 4, datetime.date(2023, 1, 7)),
 (2, 2, datetime.date(2023, 1, 5))]

In [48]:
%%sql
-- In this we are going to see JOIN functions In mysql

 * mysql+mysqlconnector://root:***@localhost/uber
0 rows affected.

[]

In [49]:
%%sql
-- we need restaurant name and order date to reporting team
-- we are going to use INNER JOIN for this report
select
r.name as restaurant_name,
o.order_date
from Restaurants r
join orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/uber
4 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 ('The Foodie', datetime.date(2023, 1, 5))]

In [50]:
%%sql
# LEFT JOIN
select
r.name as restaurant_name,
o.order_date
from Restaurants r
left join orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/uber
5 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 2)),
 ('ABC Bistro', datetime.date(2023, 1, 1)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 ('Tasty Treat', None)]

In [51]:
%%sql
# RIGHT JOIN
select 
r.name as restaurant_name,
o.order_date
from Restaurants r
right join orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/uber
5 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 (None, datetime.date(2023, 1, 7)),
 ('The Foodie', datetime.date(2023, 1, 5))]

In [52]:
%%sql
# SELF JOIN to check orders on the same date, 
SELECT 
    a.order_id AS order_one,
    b.order_id AS order_two,
    a.order_date
FROM Orders a
JOIN Orders b
    ON a.order_date = b.order_date
    AND a.order_id <> b.order_id;

 * mysql+mysqlconnector://root:***@localhost/uber
2 rows affected.

[(2, 3, datetime.date(2023, 1, 5)), (3, 2, datetime.date(2023, 1, 5))]